Tekla Open API Reference for Tekla Structures 2025
TeklaDrawingColor Constructor (DrawingColors)
 Construct a TeklaDrawingColor instance by passing in a Tekla standard color enum value. Use of this constructor is discouraged, please use TeklaDrawingColor(Color RGB)
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public TeklaDrawingColor(
	DrawingColors ColorEnum
)
Public Sub New (
	ColorEnum As DrawingColors
)
Parameters
ColorEnum
Type: Tekla.Structures.Drawing.DrawingColors
Color as DrawingColors
Exceptions
Exception | Condition
ArgumentOutOfRangeException | Throws if ColorEnum is not a valid Tekla Standard color
See Also
Reference
TeklaDrawingColor Structure
TeklaDrawingColor Overload
Tekla.Structures.Drawing Namespace